using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace Systems.Models
{
    /// <summary>
    /// Коуч
    /// </summary>
    public class coach
    {
        /// <summary>
        /// Коучийн дугаар
        /// </summary>
        public int coachid { get; set; }

        /// <summary>
        /// Коучийн нэр 
        /// </summary>
        public string name { get; set; }

        /// <summary>
        /// Утас
        /// </summary>
        public string phone { get; set; }

        //Ажиллаж буй дунд шатны хорооны нэр 
        //Хариуцсан хороод 
        //Хариуцсан бүлгүүд 
        //Хариуцсан өрхүүд

    }

    /// <summary>
    /// 
    /// </summary>
    public class household
    {

        /// <summary>
        /// Өрхийн дугаар
        /// </summary>
        public int householdid { get; set; }

        /// <summary>
        /// Ам бүлийн тоо
        /// </summary>
        public int numberof { get; set; }

        /// <summary>
        /// Өрхийн тэргүүний нэр
        /// </summary>
        public string name { get; set; }

        //Дүүрэг
        //Хороо

        /// <summary>
        /// Хаяг
        /// </summary>
        public string address { get; set; }

        /// <summary>
        /// Утас
        /// </summary>
        public string phone { get; set; }

        /// <summary>
        /// Коучийн дугаар Хариуцсан коучийн нэр
        /// </summary>
        public int coachid { get; set; }

    }

    /// <summary>
    /// Өрхийн гишүүдийн мэдээлэл
    /// </summary>
    public class householdmember
    {
        /// <summary>
        /// Дэс дугаар
        /// </summary>
        public int memberid { get; set; }

        /// <summary>
        /// Өрхийн дугаар
        /// </summary>
        public int householdid { get; set; }

        /// <summary>
        /// Өрхийн гишүүний нэр 
        /// </summary>
        public string name { get; set; }

        //Өрхийн тэргүүнтэй ямар хамааралтай болох

        /// <summary>
        /// Нас
        /// </summary>
        public DateTime birthdate { get; set; }

        /// <summary>
        /// Хүйс 0-эр, 1-эм
        /// </summary>
        public int gender { get; set; }


        //Боловсролын зэрэг
        //Хөдөлмөр эрхлэлтийн байдал
        //Эрүүл мэндийн байдал

    }

    /// <summary>
    /// Өрхийн айлчлалын мэдээлэл
    /// </summary>
    public class householdvisit
    {
        /// <summary>
        /// Бүртгэлийн дугаар
        /// </summary>
        public int visitid { get; set; }

        /// <summary>
        /// Өрхийн дугаар
        /// </summary>
        public int householdid { get; set; }

        /// <summary>
        /// Айлчилсан огноо
        /// </summary>
        public DateTime visitdate { get; set; }

        //Айлчлалаар уулзсан өрхийн гишүүд 
        //Айлчилсан хүний нэр 

        /// <summary>
        /// Тайлбар
        /// </summary>
        public string note { get; set; }

    }

    //    Хамрагддаг бүлгийн мэдээлэл
    //Харьяалагддаг бүлгийн нэр   
    //Нэгж хувьцааны үнэ

    //    Хурлын ирцийн мэдээлэл
    //Бүлгийн хурал зохион байгуулагдсан огноо    
    //Бүлгийн хуралд оролцсон эсэх    
    //Худалдан авсан хувьцааны тоо

    //    Зээлийн мэдээлэл
    //Зээл авсан огноо 
    //Бүлгээс зээлсэн мөнгөн дүн 
    //Зээлийн зориулалт

    //    Зээлийн эргэн төлөлтийн мэдээлэл
    //Зээлийн эргэн төлөлт хийсэн огноо 
    //Эргэн төлсөн мөнгөн дүн 
    //Зээлийн үлдэгдэл

    //    Сургалт, үйл ажиллагаа
    //Огноо 
    //Сургалт, үйл ажиллагаа зохион байгуулсан байгууллагын нэр 
    //Сургалт, үйл ажиллагааны нэр    
    //Сургалтын үргэжилсэн хугацаа 
    //Сургалт, үйл ажиллагаанд хамрагдсан өрхийн гишүүний нэр

    //    Амьжиргаа сайжруулах үйл ажиллагааны мэдээлэл
    //Амьжиргаа сайжруулах төлөвлөгөө боловсруулсан огноо 
    //Өрхийн сонгосон аж ахуй 
    //Харьяалагдах дэд салбар

    //    Хөрөнгө оруулалтын мэдээлэл
    //Хөрөнгө хүлээн авсан огноо 
    //Хүлээн авсан хөрөнгийн нэр 
    //Тоо ширхэг 
    //Нэгжийн үнэ 
    //Нийт үнэ 
    //Тайлбар(марк, дугаар)

    //    Бусад тусламж, дэмжлэг
    //Тусламж, дэмжлэг хүлээн авсан огноо 
    //Хүлээн авсан тусламж дэмжлэг    
    //Тоо ширхэг  
    //Нэгжийн үнэ 
    //Нийт үнэ    
    //Дэмжлэг олгосон байгууллагын нэр

    //    Сургалт, үйл ажиллагаа
    //Огноо 
    //Холбон зуучилсан байгууллагын нэр 
    //Холбон зуучилсан үйлчилгээний нэр 
    //Үйлчилгээнд холбогдсон өрхийн гишүүний нэр

    //    Дунд шатны хорооны ерөнхий мэдээлэл
    //Дунд шатны хорооны нэр 
    //Хариуцсан коуч нар  
    //Хариуцсан хороод    
    //Хариуцсан бүлгүүд   
    //Хариуцсан өрхүүд

    //    Туршилтын хөтөлбөрийн ерөнхий мэдээлэл
    //Төсөл хэрэгжих дүүргүүд 
    //Нийт коуч 
    //Нийт хороо 
    //Нийт бүлэг 
    //Нийт өрх

}
